r315/disco-ptp/target/stm32f769i-discovery/src/ethernetif.c
static void pbuf_free_custom(struct pbuf *p)
{
    struct pbuf_custom* custom_pbuf = (struct pbuf_custom*)p;
    LWIP_MEMPOOL_FREE(RX_POOL, custom_pbuf);

    if (RxAllocStatus == 1){
        RxAllocStatus = 0;
        osSemaphoreRelease(RxPktSemaphore);
    }
}

/*******************************************************************************
                       LL Driver Interface ( LwIP stack --> ETH)
*******************************************************************************/
static void low_level_init_phy(struct netif *netif)
{
    uint32_t duplex, speed;
    int32_t PHYLinkState;
    ETH_MACConfigTypeDef MACConf;

    /* Set PHY IO functions */
    LAN8742_RegisterBusIO(&LAN8742, &LAN8742_IOCtx);

    LAN8742_DeInit(&LAN8742);

    /* Initialize the LAN8742 ETH PHY */
    if(LAN8742_Init(&LAN8742) != LAN8742_STATUS_OK){
        netif_set_link_down(netif);
        netif_set_down(netif);
        return;
    }
    /* Wait for link */
    osDelay(3000);

    PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    /* Get link state */
    if(PHYLinkState <= LAN8742_STATUS_LINK_DOWN) {
        netif_set_link_down(netif);
        netif_set_down(netif);
    } else {
        switch (PHYLinkState) {
            case LAN8742_STATUS_100MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_100MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_10MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed = ETH_SPEED_10M;
                break;
            case LAN8742_STATUS_10MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed = ETH_SPEED_10M;
                break;
            default:
                duplex = ETH_FULLDUPLEX_MODE;
                speed = ETH_SPEED_100M;
                break;
        }

        /* Get MAC Config MAC */
        HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
        MACConf.DuplexMode = duplex;
        MACConf.Speed = speed;
        HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
        HAL_ETH_Start_IT(&EthHandle);
        netif_set_up(netif);
        netif_set_link_up(netif);
    }

    /* Check if it's a STM32F76xxx Revision A */
    if(HAL_GetREVID() == 0x1000) {
        /*
            This thread will keep resetting the RMII interface until good frames are received
        */
        osThreadDef(RMII_Watchdog, RMII_Thread, osPriorityRealtime, 0, configMINIMAL_STACK_SIZE);
        osThreadCreate (osThread(RMII_Watchdog), NULL);
    }
}
/**
  * @brief In this function, the hardware should be initialized.
  * Called from ethernetif_init().
  *
  * @param netif the already initialized lwip network interface structure
  *        for this ethernetif
  */
static void low_level_init(struct netif *netif)
{
    EthHandle.Instance = ETH;
    EthHandle.Init.MACAddr = netif->hwaddr;
    EthHandle.Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;
    EthHandle.Init.RxDesc = DMARxDscrTab;
    EthHandle.Init.TxDesc = DMATxDscrTab;
    EthHandle.Init.RxBuffLen = ETH_RX_BUF_SIZE;

    /* configure ethernet peripheral (GPIOs, clocks, MAC, DMA) */
    HAL_ETH_Init(&EthHandle);

    /* Initialize the RX POOL */
    LWIP_MEMPOOL_INIT(RX_POOL);

    /* Set Tx packet config common parameters */
    memset(&TxConfig, 0 , sizeof(ETH_TxPacketConfig));
    TxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
    TxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
    TxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;

    /* create a binary semaphore used for informing ethernetif of frame reception */
    RxPktSemaphore = xSemaphoreCreateBinary();
    TxPktSemaphore = xSemaphoreCreateBinary();

    /* create the task that handles the ETH_MAC */
    osThreadDef(EthIf, ethernetif_input_thread, osPriorityRealtime, 0, INTERFACE_THREAD_STACK_SIZE);
    osThreadCreate (osThread(EthIf), netif);

    low_level_init_phy(netif);
}


/**
  * @brief This function should do the actual transmission of the packet. The packet is
  * contained in the pbuf that is passed to the function. This pbuf
  * might be chained.
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @param p the MAC packet to send (e.g. IP packet including MAC addresses and type)
  * @return ERR_OK if the packet could be sent
  *         an err_t value if the packet couldn't be sent
  *
  * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
  *       strange results. You might consider waiting for space in the DMA queue
  *       to become available since the stack doesn't retry to send a packet
  *       dropped because of memory failure (except for the TCP timers).
  */
static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    uint32_t i = 0U;
    struct pbuf *q = NULL;
    err_t errval = ERR_OK;
    ETH_BufferTypeDef Txbuffer[ETH_TX_DESC_CNT];

    memset (Txbuffer, 0, ETH_TX_DESC_CNT * sizeof (ETH_BufferTypeDef));

    for (q = p; q != NULL; q = q->next)
    {
        if (i >= ETH_TX_DESC_CNT)
            return ERR_IF;

        Txbuffer[i].buffer = q->payload;
        Txbuffer[i].len    = q->len;

        if (i > 0)
        {
            Txbuffer[i - 1].next = &Txbuffer[i];
        }

        if (q->next == NULL)
        {
            Txbuffer[i].next = NULL;
        }

        i++;
    }

    TxConfig.Length   = p->tot_len;
    TxConfig.TxBuffer = Txbuffer;
    TxConfig.pData    = p;

    pbuf_ref (p);

    do {
        HAL_ETH_PTP_InsertTxTimestamp(&EthHandle);

        if (HAL_ETH_Transmit_IT (&EthHandle, &TxConfig) == HAL_OK)
        {
            errval = ERR_OK;
        }
        else
        {
            if (HAL_ETH_GetError (&EthHandle) & HAL_ETH_ERROR_BUSY)
            {
                /* Wait for descriptors to become available */
                osSemaphoreWait (TxPktSemaphore, ETHIF_TX_TIMEOUT);
                HAL_ETH_ReleaseTxPacket (&EthHandle);
                errval = ERR_BUF;
            }
            else
            {
                /* Other error */
                pbuf_free (p);
                errval = ERR_IF;
            }
        }
    } while (errval == ERR_BUF);

    return errval;
}

/**
  * @brief Should allocate a pbuf and transfer the bytes of the incoming
  * packet from the interface into the pbuf.
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return a pbuf filled with the received packet (including MAC header)
  *         NULL on memory error
  */
static struct pbuf * low_level_input(struct netif *netif)
{
    struct pbuf *p = NULL;

    if(RxAllocStatus == 0) {
        HAL_ETH_ReadData(&EthHandle, (void **)&p);
    }

    return p;
}

