r315/disco-ptp/target/stm32f769i-discovery/src/ethernetif.c
static void ll_set_mcast_mac(const uint8_t* Addr)
{
    EthHandle.Instance->MACA0HR = ETH_MACA1HR_AE | ((uint32_t)Addr[5U] << 8U) | (uint32_t)Addr[4U];
    EthHandle.Instance->MACA0LR = ((uint32_t)Addr[3U] << 24U) | ((uint32_t)Addr[2U] << 16U) | ((uint32_t)Addr[1U] << 8U) | Addr[0U];
}

/**
  * @brief  Checks whether the specified ETHERNET PTP flag is set or not.
  * @param  flag: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_FLAG_TSARU : Addend Register Update
  *     @arg ETH_PTP_FLAG_TSITE : Time Stamp Interrupt Trigger Enable
  *     @arg ETH_PTP_FLAG_TSSTU : Time Stamp Update
  *     @arg ETH_PTP_FLAG_TSSTI  : Time Stamp Initialize
  * @retval The new state of ETHERNET PTP Flag (SET or RESET).
  */
static FlagStatus ll_ptp_get_flag(uint32_t flag)
{
  FlagStatus bitstatus = RESET;

  if ((EthHandle.Instance->PTPTSCR & flag) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Sets the Time Stamp update sign and values.
  * @param  Sign: specifies the PTP Time update value sign.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_PositiveTime : positive time value.
  *     @arg ETH_PTP_NegativeTime : negative time value.
  * @param  SecondValue: specifies the PTP Time update second value.
  * @param  SubSecondValue: specifies the PTP Time update sub-second value.
  *   This parameter is a 31 bit value, bit32 correspond to the sign.
  * @retval None
  */
static void ll_ptp_set_time_stamp_update(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
    /* Set the PTP Time Update High Register */
    EthHandle.Instance->PTPTSHUR = SecondValue;
    /* Set the PTP Time Update Low Register with sign */
    EthHandle.Instance->PTPTSLUR = Sign | SubSecondValue;
}

/**
  * @brief This function is the ethernetif_input task, it is processed when a packet
  * is ready to be read from the interface. It uses the function low_level_input()
  * that should handle the actual reception of bytes from the network
  * interface. Then the type of the received packet is determined and
  * the appropriate input function is called.
  *
  * @param netif the lwip network interface structure for this ethernetif
  */
static void ethernetif_input_thread( void const * argument )
{
  struct pbuf *p;
  struct netif *netif = (struct netif *) argument;

  for( ;; )
  {
    if (osSemaphoreWait(RxPktSemaphore, TIME_WAITING_FOR_INPUT)==osOK)
    {
      do
      {
        p = low_level_input( netif );
        if (p != NULL)
        {
          if (netif->input( p, netif) != ERR_OK )
          {
            pbuf_free(p);
          }
        }
      }while(p!=NULL);
    }
  }
}

/**
  * @brief Should be called at the beginning of the program to set up the
  * network interface. It calls the function low_level_init() to do the
  * actual setup of the hardware.
  *
  * This function should be passed as a parameter to netif_add().
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return ERR_OK if the loopif is initialized
  *         ERR_MEM if private data couldn't be allocated
  *         any other err_t on error
  */
err_t ethernetif_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));

#if LWIP_NETIF_HOSTNAME
    /* Initialize interface hostname */
    netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

    netif->name[0] = IFNAME0;
    netif->name[1] = IFNAME1;
    /* set netif MAC hardware address length */
    netif->hwaddr_len = ETHARP_HWADDR_LEN;
    /* set netif MAC hardware address */
    netif->hwaddr[0] =  MAC_ADDR0;
    netif->hwaddr[1] =  MAC_ADDR1;
    netif->hwaddr[2] =  MAC_ADDR2;
    netif->hwaddr[3] =  MAC_ADDR3;
    netif->hwaddr[4] =  MAC_ADDR4;
    netif->hwaddr[5] =  MAC_ADDR5;

    /* We directly use etharp_output() here to save a function call.
    * You can instead declare your own function an call etharp_output()
    * from it if you have to do some checks before sending (e.g. if link
    * is available...) */
    netif->output = etharp_output;
    netif->linkoutput = low_level_output;

    /* set netif maximum transfer unit */
    netif->mtu = ETH_MAX_PAYLOAD;

    /* device capabilities */
    /* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
    netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;

#ifdef LWIP_IGMP
    // Accept multicast traffic.
    netif->flags |= NETIF_FLAG_IGMP;
#endif

    /* initialize the hardware */
    low_level_init(netif);

    return ERR_OK;
}

void ethernetif_ptp_init(void)
{
    ETH_PTP_ConfigTypeDef ptp_cfg;

    ptp_cfg.TimestampSubsecondInc = ADJ_FREQ_BASE_INCREMENT;
    ptp_cfg.TimestampAddend = ADJ_FREQ_BASE_ADDEND;

    ptp_cfg.Timestamp           = ENABLE;
    ptp_cfg.TimestampUpdate     = ENABLE;   // Fine update
    ptp_cfg.TimestampAll        = DISABLE;
    ptp_cfg.TimestampV2         = ENABLE;   // PTPv2 only
    ptp_cfg.TimestampIPv6       = DISABLE;
    ptp_cfg.TimestampIPv4       = ENABLE;
    ptp_cfg.TimestampEthernet   = DISABLE;  // Stamp L4 messages only
    ptp_cfg.TimestampEvent      = DISABLE;  // Should be enabled for master????
    ptp_cfg.TimestampMaster     = ENABLE;
    ptp_cfg.TimestampFilter     = DISABLE;  // Filter by MAC address, valid for L2
    ptp_cfg.TimestampClockType  = 0;        // Ordinary clock
    ptp_cfg.TimestampRolloverMode = ETH_PTP_ROLLOVER_MODE;

    ptp_cfg.TimestampAddendUpdate = ENABLE;
    ptp_cfg.TimestampUpdateMode = ENABLE;

    HAL_ETH_PTP_SetConfig(&EthHandle, &ptp_cfg);

    ll_set_mcast_mac(PTP_MCAST_MAC);
}

/**
 * @brief
 * 0000: 1 Hz with a pulse width of 125 ms for binary rollover and, of 100 ms for digital rollover
 * 0001: 2 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0010: 4 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0011: 8 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0100: 16 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * ....
 * 1111: 32768 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 */
void ethernetif_ptp_set_pps_output(uint8_t freq)
{
    GPIO_InitTypeDef gpio_init;

